/* The input string $2 could not be converted to an int. $1 is what the string was supposed to bind to. */
"<%@>: Unable to convert value to integer: %@" = "<%1$@>: Unable to convert value to integer: %2$@";

/* Failure to parse an XML file */
"alt-xml defined with no bind-xml elements in element: %@" = "alt-xml defined with no bind-xml elements in element: %@";

/* Error description when trying to write a file to a directory. $1 is the path to the user area. */
"Application support area is not a directory: %@" = "Application support area is not a directory: %@";

/* Failure to parse an XML file */
"Boolean attribute: %@ has an illegal value: %@" = "Boolean attribute: %1$@ has an illegal value: %2$@";

/* Error description: Class named $1 was redefined */
"Class redefined: %@" = "Class redefined: %@";

/* Error description: Element name $1 in class $2 was redefined */
"Element redefined: %@ class: %@" = "Element redefined: %1$@ class: %2$@";

/* XML unmarshalling failure reason */
"Invalid Mapping" = "Invalid Mapping";

/* XML value not valid */
"Invalid Value" = "Invalid Value";

/* Failure to parse an XML file */
"Invalid XML" = "Invalid XML";

/* Error binding fields in an XML file. $1 is the name of the field being bound to, $2 is the element XML string. */
"Missing required element named: %@ in element: %@" = "Missing required element named: %1$@ in element: %2$@";

/* Error when trying to marshal an XML file */
"No class name for marshalling defined: %@" = "No class name for marshalling defined: %@";

/* XML parsing error. $1 is the element name. */
"No definition to handle element: %@" = "No definition to handle element: %@";

/* A given extends ($1) has no definition in an XML file */
"No extends definition for class during marshaling: %@" = "No extends definition for class during marshaling: %@";

/* XML error description. The extends $1 is lacking a definition in an XML file. */
"No extends definition for class: %@" = "No extends definition for class: %@";

/* Failure to parse an XML file */
"No mapping definition for class: %@" = "No mapping definition for class: %@";

/* XML class unable to be mapped correctly */
"No mapping for class: %@" = "No mapping for class: %@";

/* Failure to parse an XML file containing class type $1 */
"No mapping for declared class: %@" = "No mapping for declared class: %@";

/* Missing required attribute in an XML file. $1 is the name of the field, $2 is the element XML string. */
"Required attribute missing for field: %@ in element: %@" = "Required attribute missing for field: %1$@ in element: %2$@";

/* Failure to parse an XML file */
"Required attribute: %@ not found in element: %@" = "Required attribute: %1$@ not found in element: %2$@";

/* Error binding fields in an XML file. $1 is the name of the field being bound to, $2 is the element XML string */
"Required text missing for field: %@ in element: %@" = "Required text missing for field: %1$@ in element: %2$@";

/* Value in XML file missing */
"Required value missing for field: %@ in object: %@" = "Required value missing for field: %1$@ in object: %2$@";

/* Failure to parse an XML file */
"Too many bind-xml elements in element: %@" = "Too many bind-xml elements in element: %@";

/* Error binding fields in an XML file. $1 is the name of the field being bound to, $2 is the element XML string. */
"Too many child elements of name: %@ in element: %@" = "Too many child elements of name: %1$@ in element: %2$@";

/* Error binding fields in an XML file. $1 is the name of the field being bound to, $2 is the element XML string. */
"Too many children with name: %@ in element: %@" = "Too many children with name: %1$@ in element: %2$@";

/* Failure to parse an XML file */
"Too many class elements in element: %@" = "Too many class elements in element: %@";

/* Failure to parse an XML file */
"Too many descriptions in element: %@" = "Too many descriptions in element: %@";

/* Failure error on binding fields in an XML file. $1 is the name of the field, $2 is the element XML string. */
"Too many elements defined for field: %@ in element: %@" = "Too many elements defined for field: %1$@ in element: %2$@";

/* Failure to parse an XML file */
"Too many map-to elements in element: %@" = "Too many map-to elements in element: %@";

/* Error failure reason */
"Unable to load included document" = "Unable to load included document";

/* Error description: Document named $1 could not be loaded. */
"Unable to load included file: %@" = "Unable to load included file: %@";

/* A collection class in an XML file could not be processed */
"Unable to process collection class: %@" = "Unable to process collection class: %@";

/* Error description when trying to write a file to a directory */
"Unable to write XML to user area" = "Unable to write XML to user area";

/* Error binding fields in an XML file. $1 is the list of attributes, $2 is the element name. */
"Unknown attributes found in XML document: %@ element: %@" = "Unknown attributes found in XML document: %1$@ element: %2$@";

/* Error binding fields in an XML file. $1 is the field mapping node and $2 is the field mapping. */
"Unknown field node type: %@ - %@" = "Unknown field node type: %1$@ - %2$@";

/* Error binding fields in an XML file. $1 is a counted set of child nodes, $2 is the element name. */
"Unknown fields found in XML document: %@ element: %@" = "Unknown fields found in XML document: %1$@ element: %2$@";

